class Con_main_auto:
    extra_column = 1  # 额外的添加的 column(main_auto.tableWidget)
    extra_column_data = ['选择']  # 额外增加的数据
    items_list_two = ['USD', 'RMB', '开票日期', '名额', '金额', '开票日期', '名额', '金额', '开票日期', '名额', '金额', '开票日期',
                      '名额', '金额', '开票日期', '名额', '金额', '开票日期']  # 第二行小附加数据
    items_list_one_to_two = ['客户开票金额', '报关行', '地面公司', '绑扎', '船东', '船代/订舱代']
    items_list = ['序号', extra_column_data[0], '客户名称', '货物名称', '货物类型', '货量', '件数', '体积', '到货时间', '到货码头', '到港时间', '船名航次',
                  '提单号', '起运港', '目的港', '发船日期', '到港日期', '备注', '发货人信息', '收货人信息', '通知人', '唛头',
                  '货描', '客户开票金额', '报关行', '地面公司', '绑扎', '船东', '船代/订舱代', '提单', '电放提单']
    standard_header_one = ['序号', '客户名称', '货物名称', '货物类型', '货量', '件数', '体积', '到货时间', '到货码头', '到港时间', '船名航次'
        , '提单号', '起运港', '目的港', '发船日期', '到港日期', '备注', '发货人信息', '收货人信息', '通知人', '唛头', '货描',
                           '客户开票金额', '', '', '报关行', '', '', '地面公司', '', '', '绑扎', '', '', '船东', '', '', '船代/订舱代', '',
                           '', '提单', '电放提单']
    standard_header_two = ['', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '', '',
                           'USD', 'RMB', '开票日期',
                           '名额', '金额', '开票日期', '名额', '金额', '开票日期', '名额', '金额', '开票日期', '名额', '金额', '开票日期', '名额',
                           '金额', '开票日期']

